Core/src/InformationRegisters/ЯндексДоставка/ЯндексДоставка.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЯндексДоставка</name>
  <resources>
    <name>ИдентификаторЗаказа</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>НомерЗаказа</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>ИдентификаторОтгрузки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>СпособОтгрузки</name>
    <type>
      <types>EnumRef.СпособыОтгрузки</types>
    </type>
  </resources>
  <resources>
    <name>СкладСлужбыДоставки</name>
    <type>
      <types>CatalogRef.СкладыСлужбДоставки</types>
    </type>
  </resources>
  <resources>
    <name>ИнтервалДоставки</name>
    <type>
      <types>CatalogRef.ИнтервалыДоставки</types>
    </type>
  </resources>
  <resources>
    <name>ДатаОтгрузки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>Оформлен</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыЯндексДоставки</types>
    </type>
  </resources>
  <resources>
    <name>ИзмененЛокально</name>
    <comment>Время локального изменения, UTC</comment>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <dimensions>
    <name>ЗаказПокупателя</name>
    <type>
      <types>DocumentRef.ЗаказПокупателя</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Core/src/InformationRegisters/ЯндексДоставка/ManagerModule.bsl
#Область ПрограммныйИнтерфейс

Функция СвойстваЗаказа(Знач ЗаказПокупателя) Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("ИдентификаторЗаказа", "");
	Результат.Вставить("НомерЗаказа", "");
	Результат.Вставить("Статус", "");
	
	Если Не ЗначениеЗаполнено(ЗаказПокупателя) Тогда
		Возврат Результат;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ЯндексДоставка.ИдентификаторЗаказа,
	|	ЯндексДоставка.НомерЗаказа,
	|	ЯндексДоставка.Статус
	|ИЗ
	|	РегистрСведений.ЯндексДоставка КАК ЯндексДоставка
	|ГДЕ
	|	ЯндексДоставка.ЗаказПокупателя = &ЗаказПокупателя");
	Запрос.УстановитьПараметр("ЗаказПокупателя", ЗаказПокупателя);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Результат;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();
	ЗаполнитьЗначенияСвойств(Результат, Выборка);
	
	Возврат Результат;
	
КонецФункции

Процедура ЗаписатьСвойстваЗаказа(Знач ЗаказПокупателя, Знач СпособОтгрузки, Знач Свойства) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	МенеджерЗаписи = СоздатьМенеджерЗаписи();
	МенеджерЗаписи.ЗаказПокупателя = ЗаказПокупателя;
	МенеджерЗаписи.Прочитать();
	
	МенеджерЗаписи.ЗаказПокупателя = ЗаказПокупателя;
	МенеджерЗаписи.ИдентификаторЗаказа = Свойства["id"];
	МенеджерЗаписи.НомерЗаказа = Свойства["full_num"];
	МенеджерЗаписи.СпособОтгрузки = СпособОтгрузки;
	МенеджерЗаписи.Статус = ЯндексДоставкаКлиентСервер.СтатусПоКоду(Свойства["status"]);
	МенеджерЗаписи.ИзмененЛокально = ТекущаяУниверсальнаяДата();
	
	МенеджерЗаписи.Записать();
	
КонецПроцедуры

Процедура ОбновитьСтатусЗаказа(Знач ЗаказПокупателя, Знач Статус) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	МенеджерЗаписи = СоздатьМенеджерЗаписи();
	МенеджерЗаписи.ЗаказПокупателя = ЗаказПокупателя;
	МенеджерЗаписи.Прочитать();
	
	МенеджерЗаписи.ЗаказПокупателя = ЗаказПокупателя;
	МенеджерЗаписи.Статус = Статус;
	МенеджерЗаписи.Записать();
	
КонецПроцедуры

Процедура УстановитьОтметкуИзмененЛокально(Знач ЗаказПокупателя) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	МенеджерЗаписи = СоздатьМенеджерЗаписи();
	МенеджерЗаписи.ЗаказПокупателя = ЗаказПокупателя;
	МенеджерЗаписи.Прочитать();
	
	МенеджерЗаписи.ЗаказПокупателя = ЗаказПокупателя;
	МенеджерЗаписи.ИзмененЛокально = ТекущаяУниверсальнаяДата();
	МенеджерЗаписи.Записать();
	
КонецПроцедуры

#КонецОбласти
